posts/cheap_storage_server.html
<!DOCTYPE html><html><head><!-- 2025-12-03 --><!-- 2026-01-29 Thu 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cheap storage server options</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
The cheapest storage server/device you can use in home is mobile
phone(smart phone) connected to hard disk via USB-C. If your phone
supports SD card use that too.
</p>

<p>
Second option if you have a old laptop lying around, change the hard
disk and a external hdd. You can use it as a storage server as well as
media server.
</p>

<p>
If you have old business class laptop then it might have DVD disk
which can be replaced with HDD.
</p>

<p>
If you are on tight budget and have no old pc lying around the good
way to start is buying second hand PC. I personally prefare Mini pc
which are easy to carry around in travel and power draw is very
minimal compared to PC.
</p>

<p>
If you are planning to use SSD for storage, keep below points in your
mind.
</p>

<div id="outline-container-orgd89ac49" class="outline-2">
<h2 id="orgd89ac49">SSD gotcha</h2>
<div class="outline-text-2" id="text-orgd89ac49">
<ul class="org-ul">
<li>Unpowered SSD slowly lose data</li>
<li>Don't use SSSD as backup</li>
</ul>
</div>
</div>

<div id="outline-container-org1c11b0c" class="outline-2">
<h2 id="org1c11b0c">Second hand hard disk</h2>
<div class="outline-text-2" id="text-org1c11b0c">
<ul class="org-ul">
<li>Buy SATA hard disk which is what typically used in PC not SAS (SAS is different)</li>
<li>There is website called <a href="https://serverpartdeals.com/">Server part deals</a> which provides second hard
disk. which is recommanded by many youtubers who do selfhosting
<ul class="org-ul">
<li>Refurbished (Third party provider)</li>
<li>Recertified (By the same company)</li>
</ul></li>
<li>Sweet spot is 12-16 terabyte.</li>
<li>Server part deals does provide shipping to India which is great but
when we include tax the price will be doubled.</li>
<li>In india we have following options OLX, Amazon, .. but i don't feel
like using their service better buy a new 4TB hard disk wich will be
sufficient for most of the case.</li>
</ul>
</div>
</div>

<div id="outline-container-org008f7e1" class="outline-2">
<h2 id="org008f7e1">Health of hdd, sdd</h2>
<div class="outline-text-2" id="text-org008f7e1">
<ul class="org-ul">
<li>Use S.M.A.R.T to measure the health of a device, predict possible
device failure, and provide notifications on unsafe values.</li>
<li>S.M.A.R.T. (Self-Monitoring, Analysis, and Reporting Technology)</li>
<li>More info on <a href="https://wiki.archlinux.org/title/S.M.A.R.T">https://wiki.archlinux.org/title/S.M.A.R.T</a>.</li>
</ul>

<p>
Above methods are just for storing data. If you need to backup stuff
</p>
</div>
</div>

<div id="outline-container-org8ef792c" class="outline-2">
<h2 id="org8ef792c">321 backup technique</h2>
<div class="outline-text-2" id="text-org8ef792c">
<ul class="org-ul">
<li>3 Copies of Data – Maintain three copies of data—the original, and
at least two copies.</li>
<li>2 Different Media – Use two different media types for storage. This
can help reduce any impact that may be attributable to one specific
storage media type. It’s your decision as to which storage medium
will contain the original data and which will contain any of the
additional copies.</li>
<li>1 Copy Offsite – Keep one copy offsite to prevent the possibility of
data loss due to a site-specific failure.</li>
<li>Ref: <a href="https://www.seagate.com/in/en/blog/what-is-a-3-2-1-backup-strategy/">https://www.seagate.com/in/en/blog/what-is-a-3-2-1-backup-strategy/</a></li>
</ul>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
